Revit 2026 API

# ConnectorPressureDrop Property

---

The pressure drop of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PressureDrop { get; }
```
```vb
Public ReadOnly Property PressureDrop As Double
	Get
```
```cpp
public:
property double PressureDrop {
	double get ();
}
```
```fsharp
member PressureDrop : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This connector does not support flow calculation and associated properties. |

Instantaneous pressure drop of this connector, calculated according to system.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace